tutorials/incompressible/simpleSolver/ras/turbineSiting/0.org/include/ABLConditions
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

Uref                 10.0;
Href                 20;
z0                   uniform 0.1;
turbulentKE          1.3;
windDirection        (1 0 0);
zDirection           (0 0 1);
zGround              uniform 935.0;
// ************************************************************************* //
