tutorials/incompressible/simpleSolver/ras/turbineSiting/0.org/include/sideAndTopPatches
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

top
{
    type slip;
}

sides
{
    type slip;
}

"proc.*"
{
    type            processor;
}

// ************************************************************************* //
