tutorials/incompressible/simpleSolver/ras/turbineSiting/0.org/nut
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/ABLConditions"

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    "terrain_.*"
    {
        type            nutkAtmRoughWallFunction;
        z0              $z0;
        value           uniform 0.0;
    }

    ground
    {
        type            calculated;
        value           uniform 0;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
